NordicPlayground/nrf52-ble-image-transfer-demo/main.c
/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{

}
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    app_uart_comm_params_t const comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
#if defined (UART_PRESENT)
        NRF_UART_BAUDRATE_115200
#else
        NRF_UARTE_BAUDRATE_115200
#endif
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


static void data_len_ext_set(bool status)
{
    uint8_t data_length = status ? (247 + 4) : (23 + 4);
    (void) nrf_ble_gatt_data_length_set(&m_gatt, BLE_CONN_HANDLE_INVALID, data_length);
}


static void gatt_mtu_set(uint16_t att_mtu)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, att_mtu);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_central_set(&m_gatt, att_mtu);
    APP_ERROR_CHECK(err_code);
}


static void camera_init(void)
{
#if defined(BOARD_PCA10056)
	#if(PCA10056_USE_FRONT_HEADER == 1)
			myCamera.pinScl = 13;
			myCamera.pinSda = 15;
			myCamera.pinSck = 21;
			myCamera.pinMiso = 23;
			myCamera.pinMosi = 25;
			myCamera.pinCsn = 32 + 9;
	#else
			myCamera.pinScl = 27;
			myCamera.pinSda = 26;
			myCamera.pinSck = 32 + 15;
			myCamera.pinMiso = 32 + 14;
			myCamera.pinMosi = 32 + 13;
			myCamera.pinCsn = 32 + 12;
	#endif
#elif defined(BOARD_PCA10040)
    m_camera_init.pinScl = 27;
    m_camera_init.pinSda = 26;
    m_camera_init.pinSck = 25;
    m_camera_init.pinMiso = 24;
    m_camera_init.pinMosi = 23;
    m_camera_init.pinCsn = 22;
#else
#error Board not defined or not supported
#endif    
    arducam_mini_2mp_open(&m_camera_init);
    arducam_mini_2mp_setResolution(OV2640_320x240);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    sd_app_evt_wait();
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    uint32_t img_data_length = 0;
    uint8_t img_data_buffer[255];
    
    bool erase_bonds;

    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
    
    
    // Start execution.
    //printf("\r\nUART started.\r\n");
    
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
      
    camera_init();

    data_len_ext_set(true);

    gatt_mtu_set(247);

    advertising_start();

    // Enter main loop.
    for (;;)
    {
        uint32_t image_size;
        ble_gap_phys_t gap_phys_settings;    

        switch(m_new_command_received)
        {
            case APP_CMD_SINGLE_CAPTURE:
                m_new_command_received = APP_CMD_NOCOMMAND;
                //ble_its_send_file(&m_its, test_file, TEST_FILE_SIZE);
                if(arducam_mini_2mp_bytesAvailable() == 0)
                {
                    printf("Starting capture...\r\n");
                    arducam_mini_2mp_startSingleCapture();
                    image_size = arducam_mini_2mp_bytesAvailable();
                    printf("Capture complete: size %i bytes\r\n", (int)(image_size));
                    ble_its_img_info_t image_info;
                    image_info.file_size_bytes = image_size - 1;
                    ble_its_img_info_send(&m_its, &image_info);
                    
                    // Flush the first byte (or the JPG image will be corrupted)
                    arducam_mini_2mp_fillBuffer(img_data_buffer, 1);
                }
                break;
            
            case APP_CMD_START_STREAM:
                m_new_command_received = APP_CMD_NOCOMMAND;

