NordicPlayground/nrf52-ble-image-transfer-demo/main.c
                printf("Stream mode enabled\r\n");                
                break;
                
            case APP_CMD_STOP_STREAM:
                m_new_command_received = APP_CMD_NOCOMMAND;
                m_stream_mode_active = false;
                printf("Stream mode disabled\r\n");
                break;
                
            case APP_CMD_CHANGE_RESOLUTION:
                m_new_command_received = APP_CMD_NOCOMMAND;
                printf("Change resolution to mode: %i\r\n", (int)m_new_resolution);
                switch(m_new_resolution)
                {
                    case 0:
                        arducam_mini_2mp_setResolution(OV2640_160x120);
                        break;
                    
                    case 1:
                        arducam_mini_2mp_setResolution(OV2640_320x240);
                        break;

                    case 2:
                        arducam_mini_2mp_setResolution(OV2640_640x480);
                        break;

                    case 3:
                        arducam_mini_2mp_setResolution(OV2640_800x600);
                        break;

                    case 4:
                        arducam_mini_2mp_setResolution(OV2640_1024x768);
                        break;
                    
                    case 5:
                        arducam_mini_2mp_setResolution(OV2640_1600x1200);
                        break;
                    
                } 
                break;
                
            case APP_CMD_CHANGE_PHY:   
                m_new_command_received = APP_CMD_NOCOMMAND;
            
                printf("Attempting to change phy.\r\n");
                gap_phys_settings.tx_phys = (m_new_phy == 0 ? BLE_GAP_PHY_1MBPS : BLE_GAP_PHY_2MBPS);  
                gap_phys_settings.rx_phys = (m_new_phy == 0 ? BLE_GAP_PHY_1MBPS : BLE_GAP_PHY_2MBPS);  
#ifdef S140            
                sd_ble_gap_phy_request(m_its.conn_handle, &gap_phys_settings);   
#else            
                sd_ble_gap_phy_update(m_its.conn_handle, &gap_phys_settings);  
#endif
                break;
            
            case APP_CMD_SEND_BLE_PARAMS:
                m_new_command_received = APP_CMD_NOCOMMAND;
                ble_its_ble_params_info_send(&m_its, &m_ble_params_info);
                break;
            
            default:
                break;
        }
        
        if(m_stream_mode_active)
        {
            if(img_data_length == 0 && arducam_mini_2mp_bytesAvailable() == 0)
            {
                arducam_mini_2mp_startSingleCapture();

                image_size = arducam_mini_2mp_bytesAvailable();
                
                ble_its_img_info_t image_info;
                image_info.file_size_bytes = image_size - 1;
                ble_its_img_info_send(&m_its, &image_info);
                
                // Flush the first byte (or the JPG image will be corrupted)
                arducam_mini_2mp_fillBuffer(img_data_buffer, 1);
            }
        }
        
        if(img_data_length > 0 || arducam_mini_2mp_bytesAvailable() > 0)
        {
            if(img_data_length == 0)
            {
                img_data_length = arducam_mini_2mp_fillBuffer(img_data_buffer, m_ble_its_max_data_len);
            }
            if(ble_its_send_file_fragment(&m_its, img_data_buffer, img_data_length) == NRF_SUCCESS)
            {
                img_data_length = 0;
            }                
        }
        
        if(m_new_command_received == APP_CMD_NOCOMMAND)
        {
            idle_state_handle();
        }
    }
}


/**
 * @}
 */
